nxp-mcuxpresso/sbl/target/lpc55s69/device/LPC55S69/cmsis_drivers/fsl_spi_cmsis.c
static int32_t SPI9_InterruptSend(const void *data, uint32_t num)
{
    return SPI_InterruptSend(data, num, &SPI9_InterruptDriverState);
}

static int32_t SPI9_InterruptReceive(void *data, uint32_t num)
{
    return SPI_InterruptReceive(data, num, &SPI9_InterruptDriverState);
}

static int32_t SPI9_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_InterruptTransfer(data_out, data_in, num, &SPI9_InterruptDriverState);
}

static uint32_t SPI9_InterruptGetCount(void)
{
    return SPI_InterruptGetCount(&SPI9_InterruptDriverState);
}

static int32_t SPI9_InterruptControl(uint32_t control, uint32_t arg)
{
    return SPI_InterruptControl(control, arg, &SPI9_InterruptDriverState);
}

static ARM_SPI_STATUS SPI9_InterruptGetStatus(void)
{
    return SPI_InterruptGetStatus(&SPI9_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI9 = {SPIx_GetVersion,    SPIx_GetCapabilities,
#if RTE_SPI9_DMA_EN
                              SPI9_DMAInitialize, SPI9_DMAUninitialize, SPI9_DMAPowerControl, SPI9_DMASend,
                              SPI9_DMAReceive,    SPI9_DMATransfer,     SPI9_DMAGetCount,     SPI9_DMAControl,
                              SPI9_DMAGetStatus
#else
                              SPI9_InterruptInitialize,
                              SPI9_InterruptUninitialize,
                              SPI9_InterruptPowerControl,
                              SPI9_InterruptSend,
                              SPI9_InterruptReceive,
                              SPI9_InterruptTransfer,
                              SPI9_InterruptGetCount,
                              SPI9_InterruptControl,
                              SPI9_InterruptGetStatus
#endif
};

#endif /*  SPI9  */

#if defined(SPI10) && RTE_SPI10
/* User needs to provide the implementation for SPI10_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t SPI10_GetFreq(void);
extern void SPI10_InitPins(void);
extern void SPI10_DeinitPins(void);
cmsis_spi_resource_t SPI10_Resource = {SPI10, 1, SPI10_GetFreq};

#if RTE_SPI10_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_spi_dma_resource_t SPI10_DMAResource = {RTE_SPI10_DMA_TX_DMA_BASE, RTE_SPI10_DMA_TX_CH, RTE_SPI10_DMA_RX_DMA_BASE,
                                              RTE_SPI10_DMA_RX_CH};

static cmsis_spi_dma_handle_t SPI10_DmaHandle;
static dma_handle_t SPI10_DmaTxDataHandle;
static dma_handle_t SPI10_DmaRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi10_dma_driver_state")
static cmsis_spi_dma_driver_state_t SPI10_DMADriverState = {
#else
static cmsis_spi_dma_driver_state_t SPI10_DMADriverState = {
#endif
    &SPI10_Resource, &SPI10_DMAResource, &SPI10_DmaHandle, &SPI10_DmaRxDataHandle, &SPI10_DmaTxDataHandle,
};

static int32_t SPI10_DMAInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    SPI10_InitPins();
    return SPI_DMAInitialize(cb_event, &SPI10_DMADriverState);
}

static int32_t SPI10_DMAUninitialize(void)
{
    SPI10_DeinitPins();
    return SPI_DMAUninitialize(&SPI10_DMADriverState);
}

static int32_t SPI10_DMAPowerControl(ARM_POWER_STATE state)
{
    return SPI_DMAPowerControl(state, &SPI10_DMADriverState);
}

static int32_t SPI10_DMASend(const void *data, uint32_t num)
{
    return SPI_DMASend(data, num, &SPI10_DMADriverState);
}

static int32_t SPI10_DMAReceive(void *data, uint32_t num)
{
    return SPI_DMAReceive(data, num, &SPI10_DMADriverState);
}

static int32_t SPI10_DMATransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_DMATransfer(data_out, data_in, num, &SPI10_DMADriverState);
}

static uint32_t SPI10_DMAGetCount(void)
{
    return SPI_DMAGetCount(&SPI10_DMADriverState);
}

static int32_t SPI10_DMAControl(uint32_t control, uint32_t arg)
{
    return SPI_DMAControl(control, arg, &SPI10_DMADriverState);
}

static ARM_SPI_STATUS SPI10_DMAGetStatus(void)
{
    return SPI_DMAGetStatus(&SPI10_DMADriverState);
}

#endif

#else

static cmsis_spi_handle_t SPI10_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi10_interrupt_driver_state")
static cmsis_spi_interrupt_driver_state_t SPI10_InterruptDriverState = {
#else
static cmsis_spi_interrupt_driver_state_t SPI10_InterruptDriverState = {
#endif
    &SPI10_Resource,
    &SPI10_Handle,
};

static int32_t SPI10_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    SPI10_InitPins();
    return SPI_InterruptInitialize(cb_event, &SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptUninitialize(void)
{
    SPI10_DeinitPins();
    return SPI_InterruptUninitialize(&SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptPowerControl(ARM_POWER_STATE state)
{
    return SPI_InterruptPowerControl(state, &SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptSend(const void *data, uint32_t num)
{
    return SPI_InterruptSend(data, num, &SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptReceive(void *data, uint32_t num)
{
    return SPI_InterruptReceive(data, num, &SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_InterruptTransfer(data_out, data_in, num, &SPI10_InterruptDriverState);
}

static uint32_t SPI10_InterruptGetCount(void)
{
    return SPI_InterruptGetCount(&SPI10_InterruptDriverState);
}

static int32_t SPI10_InterruptControl(uint32_t control, uint32_t arg)
{
    return SPI_InterruptControl(control, arg, &SPI10_InterruptDriverState);
}

static ARM_SPI_STATUS SPI10_InterruptGetStatus(void)
{
    return SPI_InterruptGetStatus(&SPI10_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI10 = {SPIx_GetVersion,     SPIx_GetCapabilities,
#if RTE_SPI10_DMA_EN
                               SPI10_DMAInitialize, SPI10_DMAUninitialize, SPI10_DMAPowerControl, SPI10_DMASend,
                               SPI10_DMAReceive,    SPI10_DMATransfer,     SPI10_DMAGetCount,     SPI10_DMAControl,
                               SPI10_DMAGetStatus
#else
                               SPI10_InterruptInitialize,
                               SPI10_InterruptUninitialize,
                               SPI10_InterruptPowerControl,
                               SPI10_InterruptSend,
                               SPI10_InterruptReceive,
                               SPI10_InterruptTransfer,
                               SPI10_InterruptGetCount,
                               SPI10_InterruptControl,
                               SPI10_InterruptGetStatus
#endif
};

#endif /*  SPI10  */

#if defined(SPI11) && RTE_SPI11
/* User needs to provide the implementation for SPI11_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t SPI11_GetFreq(void);
extern void SPI11_InitPins(void);
extern void SPI11_DeinitPins(void);
cmsis_spi_resource_t SPI11_Resource = {SPI11, 1, SPI11_GetFreq};

#if RTE_SPI11_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

