nxp-mcuxpresso/sbl/target/lpc55s69/device/LPC55S69/cmsis_drivers/fsl_spi_cmsis.c
cmsis_spi_dma_resource_t SPI11_DMAResource = {RTE_SPI11_DMA_TX_DMA_BASE, RTE_SPI11_DMA_TX_CH, RTE_SPI11_DMA_RX_DMA_BASE,
                                              RTE_SPI11_DMA_RX_CH};

static cmsis_spi_dma_handle_t SPI11_DmaHandle;
static dma_handle_t SPI11_DmaTxDataHandle;
static dma_handle_t SPI11_DmaRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi11_dma_driver_state")
static cmsis_spi_dma_driver_state_t SPI11_DMADriverState = {
#else
static cmsis_spi_dma_driver_state_t SPI11_DMADriverState = {
#endif
    &SPI11_Resource, &SPI11_DMAResource, &SPI11_DmaHandle, &SPI11_DmaRxDataHandle, &SPI11_DmaTxDataHandle,
};

static int32_t SPI11_DMAInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    SPI11_InitPins();
    return SPI_DMAInitialize(cb_event, &SPI11_DMADriverState);
}

static int32_t SPI11_DMAUninitialize(void)
{
    SPI11_DeinitPins();
    return SPI_DMAUninitialize(&SPI11_DMADriverState);
}

static int32_t SPI11_DMAPowerControl(ARM_POWER_STATE state)
{
    return SPI_DMAPowerControl(state, &SPI11_DMADriverState);
}

static int32_t SPI11_DMASend(const void *data, uint32_t num)
{
    return SPI_DMASend(data, num, &SPI11_DMADriverState);
}

static int32_t SPI11_DMAReceive(void *data, uint32_t num)
{
    return SPI_DMAReceive(data, num, &SPI11_DMADriverState);
}

static int32_t SPI11_DMATransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_DMATransfer(data_out, data_in, num, &SPI11_DMADriverState);
}

static uint32_t SPI11_DMAGetCount(void)
{
    return SPI_DMAGetCount(&SPI11_DMADriverState);
}

static int32_t SPI11_DMAControl(uint32_t control, uint32_t arg)
{
    return SPI_DMAControl(control, arg, &SPI11_DMADriverState);
}

static ARM_SPI_STATUS SPI11_DMAGetStatus(void)
{
    return SPI_DMAGetStatus(&SPI11_DMADriverState);
}

#endif

#else

static cmsis_spi_handle_t SPI11_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi11_interrupt_driver_state")
static cmsis_spi_interrupt_driver_state_t SPI11_InterruptDriverState = {
#else
static cmsis_spi_interrupt_driver_state_t SPI11_InterruptDriverState = {
#endif
    &SPI11_Resource,
    &SPI11_Handle,
};

static int32_t SPI11_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    SPI11_InitPins();
    return SPI_InterruptInitialize(cb_event, &SPI11_InterruptDriverState);
}

static int32_t SPI11_InterruptUninitialize(void)
{
    SPI11_DeinitPins();
    return SPI_InterruptUninitialize(&SPI11_InterruptDriverState);
}

static int32_t SPI11_InterruptPowerControl(ARM_POWER_STATE state)
{
    return SPI_InterruptPowerControl(state, &SPI11_InterruptDriverState);
}

static int32_t SPI11_InterruptSend(const void *data, uint32_t num)
{
    return SPI_InterruptSend(data, num, &SPI11_InterruptDriverState);
}

static int32_t SPI11_InterruptReceive(void *data, uint32_t num)
{
    return SPI_InterruptReceive(data, num, &SPI11_InterruptDriverState);
}

static int32_t SPI11_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_InterruptTransfer(data_out, data_in, num, &SPI11_InterruptDriverState);
}

static uint32_t SPI11_InterruptGetCount(void)
{
    return SPI_InterruptGetCount(&SPI11_InterruptDriverState);
}

static int32_t SPI11_InterruptControl(uint32_t control, uint32_t arg)
{
    return SPI_InterruptControl(control, arg, &SPI11_InterruptDriverState);
}

static ARM_SPI_STATUS SPI11_InterruptGetStatus(void)
{
    return SPI_InterruptGetStatus(&SPI11_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI11 = {SPIx_GetVersion,     SPIx_GetCapabilities,
#if RTE_SPI11_DMA_EN
                               SPI11_DMAInitialize, SPI11_DMAUninitialize, SPI11_DMAPowerControl, SPI11_DMASend,
                               SPI11_DMAReceive,    SPI11_DMATransfer,     SPI11_DMAGetCount,     SPI11_DMAControl,
                               SPI11_DMAGetStatus
#else
                               SPI11_InterruptInitialize,
                               SPI11_InterruptUninitialize,
                               SPI11_InterruptPowerControl,
                               SPI11_InterruptSend,
                               SPI11_InterruptReceive,
                               SPI11_InterruptTransfer,
                               SPI11_InterruptGetCount,
                               SPI11_InterruptControl,
                               SPI11_InterruptGetStatus
#endif
};

#endif /*  SPI11  */

#if defined(SPI12) && RTE_SPI12
/* User needs to provide the implementation for SPI12_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t SPI12_GetFreq(void);
extern void SPI12_InitPins(void);
extern void SPI12_DeinitPins(void);
cmsis_spi_resource_t SPI12_Resource = {SPI12, 1, SPI12_GetFreq};

#if RTE_SPI12_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_spi_dma_resource_t SPI12_DMAResource = {RTE_SPI12_DMA_TX_DMA_BASE, RTE_SPI12_DMA_TX_CH, RTE_SPI12_DMA_RX_DMA_BASE,
                                              RTE_SPI12_DMA_RX_CH};

static cmsis_spi_dma_handle_t SPI12_DmaHandle;
static dma_handle_t SPI12_DmaTxDataHandle;
static dma_handle_t SPI12_DmaRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi12_dma_driver_state")
static cmsis_spi_dma_driver_state_t SPI12_DMADriverState = {
#else
static cmsis_spi_dma_driver_state_t SPI12_DMADriverState = {
#endif
    &SPI12_Resource, &SPI12_DMAResource, &SPI12_DmaHandle, &SPI12_DmaRxDataHandle, &SPI12_DmaTxDataHandle,
};

static int32_t SPI12_DMAInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    SPI12_InitPins();
    return SPI_DMAInitialize(cb_event, &SPI12_DMADriverState);
}

static int32_t SPI12_DMAUninitialize(void)
{
    SPI12_DeinitPins();
    return SPI_DMAUninitialize(&SPI12_DMADriverState);
}

static int32_t SPI12_DMAPowerControl(ARM_POWER_STATE state)
{
    return SPI_DMAPowerControl(state, &SPI12_DMADriverState);
}

static int32_t SPI12_DMASend(const void *data, uint32_t num)
{
    return SPI_DMASend(data, num, &SPI12_DMADriverState);
}

