nxp-mcuxpresso/sbl/target/lpc55s69/device/LPC55S69/cmsis_drivers/fsl_spi_cmsis.c
static int32_t SPI12_DMAReceive(void *data, uint32_t num)
{
    return SPI_DMAReceive(data, num, &SPI12_DMADriverState);
}

static int32_t SPI12_DMATransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_DMATransfer(data_out, data_in, num, &SPI12_DMADriverState);
}

static uint32_t SPI12_DMAGetCount(void)
{
    return SPI_DMAGetCount(&SPI12_DMADriverState);
}

static int32_t SPI12_DMAControl(uint32_t control, uint32_t arg)
{
    return SPI_DMAControl(control, arg, &SPI12_DMADriverState);
}

static ARM_SPI_STATUS SPI12_DMAGetStatus(void)
{
    return SPI_DMAGetStatus(&SPI12_DMADriverState);
}

#endif

#else

static cmsis_spi_handle_t SPI12_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi12_interrupt_driver_state")
static cmsis_spi_interrupt_driver_state_t SPI12_InterruptDriverState = {
#else
static cmsis_spi_interrupt_driver_state_t SPI12_InterruptDriverState = {
#endif
    &SPI12_Resource,
    &SPI12_Handle,
};

static int32_t SPI12_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    SPI12_InitPins();
    return SPI_InterruptInitialize(cb_event, &SPI12_InterruptDriverState);
}

static int32_t SPI12_InterruptUninitialize(void)
{
    SPI12_DeinitPins();
    return SPI_InterruptUninitialize(&SPI12_InterruptDriverState);
}

static int32_t SPI12_InterruptPowerControl(ARM_POWER_STATE state)
{
    return SPI_InterruptPowerControl(state, &SPI12_InterruptDriverState);
}

static int32_t SPI12_InterruptSend(const void *data, uint32_t num)
{
    return SPI_InterruptSend(data, num, &SPI12_InterruptDriverState);
}

static int32_t SPI12_InterruptReceive(void *data, uint32_t num)
{
    return SPI_InterruptReceive(data, num, &SPI12_InterruptDriverState);
}

static int32_t SPI12_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_InterruptTransfer(data_out, data_in, num, &SPI12_InterruptDriverState);
}

static uint32_t SPI12_InterruptGetCount(void)
{
    return SPI_InterruptGetCount(&SPI12_InterruptDriverState);
}

static int32_t SPI12_InterruptControl(uint32_t control, uint32_t arg)
{
    return SPI_InterruptControl(control, arg, &SPI12_InterruptDriverState);
}

static ARM_SPI_STATUS SPI12_InterruptGetStatus(void)
{
    return SPI_InterruptGetStatus(&SPI12_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI12 = {SPIx_GetVersion,     SPIx_GetCapabilities,
#if RTE_SPI12_DMA_EN
                               SPI12_DMAInitialize, SPI12_DMAUninitialize, SPI12_DMAPowerControl, SPI12_DMASend,
                               SPI12_DMAReceive,    SPI12_DMATransfer,     SPI12_DMAGetCount,     SPI12_DMAControl,
                               SPI12_DMAGetStatus
#else
                               SPI12_InterruptInitialize,
                               SPI12_InterruptUninitialize,
                               SPI12_InterruptPowerControl,
                               SPI12_InterruptSend,
                               SPI12_InterruptReceive,
                               SPI12_InterruptTransfer,
                               SPI12_InterruptGetCount,
                               SPI12_InterruptControl,
                               SPI12_InterruptGetStatus
#endif
};

#endif /*  SPI12  */

#if defined(SPI13) && RTE_SPI13
/* User needs to provide the implementation for SPI13_GetFreq/InitPins/DeinitPins
in the application for enabling according instance. */
extern uint32_t SPI13_GetFreq(void);
extern void SPI13_InitPins(void);
extern void SPI13_DeinitPins(void);
cmsis_spi_resource_t SPI13_Resource = {SPI13, 1, SPI13_GetFreq};

#if RTE_SPI13_DMA_EN

#if (defined(FSL_FEATURE_SOC_DMA_COUNT) && FSL_FEATURE_SOC_DMA_COUNT)

cmsis_spi_dma_resource_t SPI13_DMAResource = {RTE_SPI13_DMA_TX_DMA_BASE, RTE_SPI13_DMA_TX_CH, RTE_SPI13_DMA_RX_DMA_BASE,
                                              RTE_SPI13_DMA_RX_CH};

static cmsis_spi_dma_handle_t SPI13_DmaHandle;
static dma_handle_t SPI13_DmaTxDataHandle;
static dma_handle_t SPI13_DmaRxDataHandle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi13_dma_driver_state")
static cmsis_spi_dma_driver_state_t SPI13_DMADriverState = {
#else
static cmsis_spi_dma_driver_state_t SPI13_DMADriverState = {
#endif
    &SPI13_Resource, &SPI13_DMAResource, &SPI13_DmaHandle, &SPI13_DmaRxDataHandle, &SPI13_DmaTxDataHandle,
};

static int32_t SPI13_DMAInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    SPI13_InitPins();
    return SPI_DMAInitialize(cb_event, &SPI13_DMADriverState);
}

static int32_t SPI13_DMAUninitialize(void)
{
    SPI13_DeinitPins();
    return SPI_DMAUninitialize(&SPI13_DMADriverState);
}

static int32_t SPI13_DMAPowerControl(ARM_POWER_STATE state)
{
    return SPI_DMAPowerControl(state, &SPI13_DMADriverState);
}

static int32_t SPI13_DMASend(const void *data, uint32_t num)
{
    return SPI_DMASend(data, num, &SPI13_DMADriverState);
}

static int32_t SPI13_DMAReceive(void *data, uint32_t num)
{
    return SPI_DMAReceive(data, num, &SPI13_DMADriverState);
}

static int32_t SPI13_DMATransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_DMATransfer(data_out, data_in, num, &SPI13_DMADriverState);
}

static uint32_t SPI13_DMAGetCount(void)
{
    return SPI_DMAGetCount(&SPI13_DMADriverState);
}

static int32_t SPI13_DMAControl(uint32_t control, uint32_t arg)
{
    return SPI_DMAControl(control, arg, &SPI13_DMADriverState);
}

static ARM_SPI_STATUS SPI13_DMAGetStatus(void)
{
    return SPI_DMAGetStatus(&SPI13_DMADriverState);
}

#endif

#else

static cmsis_spi_handle_t SPI13_Handle;

#if defined(__CC_ARM) || defined(__ARMCC_VERSION)
ARMCC_SECTION("spi13_interrupt_driver_state")
static cmsis_spi_interrupt_driver_state_t SPI13_InterruptDriverState = {
#else
static cmsis_spi_interrupt_driver_state_t SPI13_InterruptDriverState = {
#endif
    &SPI13_Resource,
    &SPI13_Handle,
};

static int32_t SPI13_InterruptInitialize(ARM_SPI_SignalEvent_t cb_event)
{
    SPI13_InitPins();
    return SPI_InterruptInitialize(cb_event, &SPI13_InterruptDriverState);
}

