nxp-mcuxpresso/sbl/target/lpc55s69/device/LPC55S69/cmsis_drivers/fsl_spi_cmsis.c
static int32_t SPI13_InterruptUninitialize(void)
{
    SPI13_DeinitPins();
    return SPI_InterruptUninitialize(&SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptPowerControl(ARM_POWER_STATE state)
{
    return SPI_InterruptPowerControl(state, &SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptSend(const void *data, uint32_t num)
{
    return SPI_InterruptSend(data, num, &SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptReceive(void *data, uint32_t num)
{
    return SPI_InterruptReceive(data, num, &SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptTransfer(const void *data_out, void *data_in, uint32_t num)
{
    return SPI_InterruptTransfer(data_out, data_in, num, &SPI13_InterruptDriverState);
}

static uint32_t SPI13_InterruptGetCount(void)
{
    return SPI_InterruptGetCount(&SPI13_InterruptDriverState);
}

static int32_t SPI13_InterruptControl(uint32_t control, uint32_t arg)
{
    return SPI_InterruptControl(control, arg, &SPI13_InterruptDriverState);
}

static ARM_SPI_STATUS SPI13_InterruptGetStatus(void)
{
    return SPI_InterruptGetStatus(&SPI13_InterruptDriverState);
}

#endif

ARM_DRIVER_SPI Driver_SPI13 = {SPIx_GetVersion,     SPIx_GetCapabilities,
#if RTE_SPI13_DMA_EN
                               SPI13_DMAInitialize, SPI13_DMAUninitialize, SPI13_DMAPowerControl, SPI13_DMASend,
                               SPI13_DMAReceive,    SPI13_DMATransfer,     SPI13_DMAGetCount,     SPI13_DMAControl,
                               SPI13_DMAGetStatus
#else
                               SPI13_InterruptInitialize,
                               SPI13_InterruptUninitialize,
                               SPI13_InterruptPowerControl,
                               SPI13_InterruptSend,
                               SPI13_InterruptReceive,
                               SPI13_InterruptTransfer,
                               SPI13_InterruptGetCount,
                               SPI13_InterruptControl,
                               SPI13_InterruptGetStatus
#endif
};

#endif /*  SPI13  */
